{"question_id": 0, "question_text": "Where is the polyp located in the image", "text": "The polyp is located in the antrum, which is the lower portion of the stomach."}
{"question_id": 1, "question_text": "Describe the image concisely.", "text": "The image is a colonoscopy, which is a procedure that allows a doctor to examine the inside of the colon using a flexible tube with a light and camera attached to it. The image likely shows the colon's inner lining, and it may reveal any abnormalities or issues within the colon."}
{"question_id": 2, "question_text": "Describe the image concisely.", "text": "The image is a colonoscopy, which is a procedure that allows a doctor to examine the inside of the colon using a flexible tube with a camera and light at the end. The image likely shows the colon's inner lining, and it may reveal any abnormalities or issues within the colon."}
{"question_id": 3, "question_text": "Describe the image concisely.", "text": "The image is a colonoscopy, which is a procedure that allows a doctor to examine the inside of the colon using a flexible tube with a camera and light at the end. The image shows the colon during the procedure."}
{"question_id": 4, "question_text": "Where is the polyp located in the image", "text": "The polyp is located in the antrum of the stomach."}
{"question_id": 5, "question_text": "Describe the image concisely.", "text": "The image is a colonoscopy, which is a procedure that allows a doctor to examine the inside of the colon using a flexible tube with a camera and light at the end. The image likely shows the colon's inner lining and any abnormalities or findings that were observed during the procedure."}
{"question_id": 6, "question_text": "Where is the polyp located in the image", "text": "The polyp is located in the antrum of the stomach."}
{"question_id": 7, "question_text": "Where is the polyp located in the image", "text": "The polyp is located in the antrum of the stomach, which is the lower part of the stomach."}
{"question_id": 8, "question_text": "Where is the polyp located in the image", "text": "The polyp is located in the antrum, which is the lower portion of the stomach."}
{"question_id": 9, "question_text": "Where is the polyp located in the image", "text": "The polyp is located in the distal colon, which is the lower part of the colon."}
{"question_id": 10, "question_text": "Describe the image concisely.", "text": "The image is a gastrointestinal endoscopy, which is a procedure that allows a doctor to examine the inside of the gastrointestinal tract using a flexible tube with a light and camera attached to it."}
{"question_id": 11, "question_text": "Describe the image concisely.", "text": "The image is a gross specimen of a resected tumor. It shows the tumor after it has been surgically removed from the patient."}
{"question_id": 12, "question_text": "Describe the image concisely.", "text": "The image is a gastrointestinal endoscopy, which is a procedure that allows a doctor to examine the inside of the gastrointestinal tract using a flexible tube with a light and camera attached to it. In this particular image, the endoscope is being used to visualize the gastrointestinal tract, likely to identify any abnormalities or issues that may be present."}
{"question_id": 13, "question_text": "Describe the image concisely.", "text": "The image is a bronchoscopy, which is a procedure that allows a doctor to examine the inside of the lungs and the airways that lead to them. In this case, the bronchoscopy is showing the presence of a foreign body in the right main bronchus."}
{"question_id": 14, "question_text": "Describe the image concisely.", "text": "The image is a colonoscopy, which is a procedure that allows a doctor to examine the inside of the colon using a flexible tube with a camera and light attached to it. In this particular image, the colonoscopy is being performed on a patient with a known colonic mass."}
{"question_id": 15, "question_text": "Describe the image concisely.", "text": "The image is a videoendoscopy of the gastroesophageal junction, which is the area where the esophagus connects to the stomach."}
{"question_id": 16, "question_text": "Describe the image concisely.", "text": "The image is a gastrointestinal endoscopy, which is a procedure that allows a doctor to examine the inside of the gastrointestinal tract using an endoscope. The endoscope is a flexible tube with a light and camera at the end, which is inserted through the mouth and into the stomach and intestines."}
{"question_id": 17, "question_text": "Describe the image concisely.", "text": "The image is a bronchoscopic view of a bronchial tumor. It shows the tumor as it appears through a bronchoscope, which is a flexible tube with a light and camera attached to it, allowing doctors to examine the inside of the airways and lungs."}
{"question_id": 18, "question_text": "Describe the image concisely.", "text": "The image is a colonoscopy, which is a procedure that allows a doctor to examine the inside of the colon using a flexible tube with a camera and light attached to it. The image shows a view of the colon during the procedure."}
{"question_id": 19, "question_text": "Describe the image concisely.", "text": "The image is a bronchoscopy, which is a procedure that allows a doctor to examine the inside of the lungs and the airways that lead to them. In this particular image, the bronchoscope is inserted through the nose and into the trachea, providing a view of the airways."}
{"question_id": 20, "question_text": "Describe the image concisely.", "text": "The image is a bronchoscopy, which is a procedure that allows a doctor to examine the inside of the lungs and airways. In this case, the bronchoscopy is showing the presence of a foreign body in the left main bronchus."}
{"question_id": 21, "question_text": "Describe the image concisely.", "text": "The image is a bronchoscopic view of the left main bronchus. It shows a mass with a central ulceration and a surrounding rim of mucosal edema."}
{"question_id": 22, "question_text": "Describe the image concisely.", "text": "The image is a bronchoscopy, which is a procedure that allows a doctor to examine the inside of the lungs using a thin, flexible tube called a bronchoscope. In this case, the bronchoscopy is showing the presence of a foreign body, which is an object that is not normally found in the lung tissue."}
{"question_id": 23, "question_text": "Describe the image concisely.", "text": "The image is a virtual endoscopy of the gastroesophageal junction, which is the area where the esophagus connects to the stomach. The image is taken using a 3D endoscope, which allows for a more detailed and comprehensive view of the anatomy."}
{"question_id": 24, "question_text": "Describe the image concisely.", "text": "The image is a video endoscopy, which is a type of endoscopic examination that allows doctors to visualize the inside of the body using a flexible tube with a camera attached to it. In this case, the endoscopy is being used to examine the gastrointestinal tract, specifically the duodenum, which is the first part of the small intestine."}
{"question_id": 25, "question_text": "Describe the image concisely.", "text": "The image is a colonoscopy, which is a procedure that allows a doctor to examine the inside of the colon using a flexible tube with a light and camera attached to it. The image shows the colon, and it is likely that the colonoscopy was performed to investigate a patient's symptoms or to detect any abnormalities in the colon."}
{"question_id": 26, "question_text": "Where is the polyp located in the image", "text": "The polyp is located in the antrum of the stomach."}
{"question_id": 27, "question_text": "Describe the image concisely.", "text": "The image is a gross specimen of a resected tumor. It shows the tumor after it has been surgically removed from the patient."}
{"question_id": 28, "question_text": "Describe the image concisely.", "text": "The image is a gastrointestinal endoscopy, which is a procedure that allows a doctor to examine the inside of the gastrointestinal tract using a flexible tube with a light and camera attached to it. In this case, the endoscopy is showing the presence of a tumor in the gastrointestinal tract."}
{"question_id": 29, "question_text": "Describe the image concisely.", "text": "The image is a video endoscopic view of the stomach. It shows the stomach's inner lining, which appears to be normal."}
{"question_id": 30, "question_text": "Describe the image concisely.", "text": "The image is a colonoscopy, which is a procedure that allows a doctor to examine the inside of the colon using a flexible tube with a camera and light at the end. The image likely shows the colon's inner lining and any abnormalities or findings that may be present."}
{"question_id": 31, "question_text": "Describe the image concisely.", "text": "The image is a gross specimen of a tumor that has been removed from the patient. It shows the tumor's gross appearance, which means it is a visual representation of the tumor's size, shape, and color."}
{"question_id": 32, "question_text": "Describe the image concisely.", "text": "The image is a bronchoscopy, which is a procedure that allows a doctor to examine the inside of the lungs and the airways that lead to them. In this case, the bronchoscopy is showing the presence of a foreign body in the patient's airway."}
{"question_id": 33, "question_text": "Describe the image concisely.", "text": "The image is a colonoscopy, which is a procedure that allows a doctor to examine the inside of the colon using a flexible tube with a camera attached to it. In this particular image, you can see the colonic mucosa, which is the lining of the colon."}
{"question_id": 34, "question_text": "Describe the image concisely.", "text": "The image is a gastrointestinal endoscopy, which is a procedure that allows a doctor to examine the inside of the gastrointestinal tract using a flexible tube with a light and camera attached to it. In this case, the endoscopy is showing a mass in the stomach."}
{"question_id": 35, "question_text": "Where is the polyp located in the image", "text": "The polyp is located in the antrum of the stomach, which is the lower portion of the stomach."}
{"question_id": 36, "question_text": "Describe the image concisely.", "text": "The image is a colonoscopy, which is a procedure that allows a doctor to examine the inside of the colon using a flexible tube with a camera and light at the end. In this particular image, the colonoscopy is showing the presence of a polyp."}
{"question_id": 37, "question_text": "Describe the image concisely.", "text": "The image is a colonoscopy, which is a procedure that allows a doctor to examine the inside of the colon using a flexible tube with a camera and light at the end. In this particular image, the colonoscopy is showing a polyp, which is an abnormal growth of tissue that can be found in the colon."}
{"question_id": 38, "question_text": "Describe the image concisely.", "text": "The image is a bronchoscopy, which is a procedure that allows a doctor to examine the inside of the lungs and airways using a thin, flexible tube called a bronchoscope. The bronchoscope is inserted through the nose or mouth and into the trachea (windpipe) and bronchi (airways) to visualize the structures and identify any abnormalities."}
{"question_id": 39, "question_text": "Describe the image concisely.", "text": "The image is a colonoscopy, which is a procedure that allows a doctor to examine the inside of the colon using a flexible tube with a camera and light at the end. The image likely shows the colon's inner lining and any abnormalities or findings that may be present."}
{"question_id": 40, "question_text": "Where is the polyp located in the image", "text": "The polyp is located in the antrum, which is the lower part of the stomach."}
{"question_id": 41, "question_text": "Where is the polyp located in the image", "text": "The polyp is located in the antrum, which is the lower part of the stomach."}
{"question_id": 42, "question_text": "Describe the image concisely.", "text": "The image is a bronchoscopy, which is a procedure that allows a doctor to examine the inside of the lungs and airways using a thin, flexible tube called a bronchoscope. In this particular image, the bronchoscope is being used to visualize the airways and assess any abnormalities or issues within the lungs."}
{"question_id": 43, "question_text": "Where is the polyp located in the image", "text": "The polyp is located in the antrum of the stomach, which is the lower portion of the stomach."}
{"question_id": 44, "question_text": "Where is the polyp located in the image", "text": "The polyp is located in the antrum of the stomach, which is the lower portion of the stomach."}
{"question_id": 45, "question_text": "Describe the image concisely.", "text": "The image is a colonoscopy, which is a procedure that allows a doctor to examine the inside of the colon using a flexible tube with a camera and light at the end. In this particular image, you can see the colon and any abnormalities or findings that may be present."}
{"question_id": 46, "question_text": "Where is the polyp located in the image", "text": "The polyp is located in the antrum of the stomach, which is the lower portion of the stomach."}
{"question_id": 47, "question_text": "Describe the image concisely.", "text": "The image is a bronchoscopy, which is a procedure that allows a doctor to examine the inside of the lungs and airways using a thin, flexible tube called a bronchoscope. In this particular image, the bronchoscope is being used to visualize the airways and assess the patient's condition."}
{"question_id": 48, "question_text": "Where is the polyp located in the image", "text": "The polyp is located in the antrum of the stomach, which is the lower portion of the stomach."}
{"question_id": 49, "question_text": "Describe the image concisely.", "text": "The image is a bronchoscopy, which is a procedure that allows a doctor to examine the inside of the lungs and airways using a thin, flexible tube called a bronchoscope. In this case, the bronchoscopy is showing the presence of a foreign body in the airway."}
{"question_id": 50, "question_text": "WDescribe the image concisely.", "text": "The image is a colonoscopy, which is a procedure that allows a doctor to examine the inside of the colon using a flexible tube with a light and camera attached to it. The image shows the colon, and it is likely that the doctor is looking for any abnormalities or issues within the colon."}
{"question_id": 51, "question_text": "Where is the polyp located in the image", "text": "The polyp is located in the antrum of the stomach, which is the lower portion of the stomach near the pylorus."}
{"question_id": 52, "question_text": "Where is the polyp located in the image", "text": "The polyp is located in the cecum, which is a part of the large intestine."}
