{"question_id": 0, "question_text": "Where is the polyp located in the image", "text": "The polyp is located in the lower part of the image, specifically in the lower part of the stomach."}
{"question_id": 1, "question_text": "Describe the image concisely.", "text": "The image shows a close-up view of a person's stomach, likely from a medical perspective. The stomach is displayed on a computer screen, with a graphic image of the stomach area and a clock visible in the upper left corner. The image is quite detailed, providing a clear view of the internal organs and the surrounding area."}
{"question_id": 2, "question_text": "Describe the image concisely.", "text": "The image displays a medical screen showing a close-up view of a person's intestines. The screen is showing a section of the intestines, possibly a stomach or an infected area. The image appears to be a medical visual aid or a video, providing a detailed view of the internal organs."}
{"question_id": 3, "question_text": "Describe the image concisely.", "text": "The image displays a close-up view of a person's stomach, showing a large, open, and inflamed area. The stomach appears to be infected, with a yellowish substance spreading throughout the area. The image also includes a video screen in the upper left corner, possibly showing a medical procedure or a visual aid for the viewer."}
{"question_id": 4, "question_text": "Where is the polyp located in the image", "text": "The polyp is located in the lower part of the image, inside the person's abdomen."}
{"question_id": 5, "question_text": "Describe the image concisely.", "text": "The image shows a close-up view of a person's abdomen, focusing on the intestines and the surrounding area. The intestines are visible in the center of the image, with a large hole in the center. The area around the intestines appears to be red and inflamed. The image also displays a time stamp, indicating the date and time the photo was taken."}
{"question_id": 6, "question_text": "Where is the polyp located in the image", "text": "The polyp is located in the lower part of the stomach, near the anus."}
{"question_id": 7, "question_text": "Where is the polyp located in the image", "text": "The polyp is located in the lower part of the image, near the bottom of the screen."}
{"question_id": 8, "question_text": "Where is the polyp located in the image", "text": "The polyp is located in the lower part of the stomach, near the rectum."}
{"question_id": 9, "question_text": "Where is the polyp located in the image", "text": "The polyp is located in the lower part of the image, specifically in the lower abdomen area."}
{"question_id": 10, "question_text": "Describe the image concisely.", "text": "The image displays a close-up view of an inflamed and infected intestinal area, likely in the stomach or abdomen. The area appears to be in a state of distress, with a visible hole in the middle of the inflammation. The image is captured using a microscope, providing a detailed view of the affected area."}
{"question_id": 11, "question_text": "Describe the image concisely.", "text": "The image displays a close-up view of a human stomach with a green background. The stomach is covered in a white substance, possibly an oily substance, and appears to be a medical image. The stomach is located in the center of the image, with the background providing a contrasting color."}
{"question_id": 12, "question_text": "Describe the image concisely.", "text": "The image shows a close-up view of a surgical procedure, where a surgeon is operating on a patient's abdominal area. The surgeon is using a scalpel to make an incision in the patient's abdomen, with the scalpel positioned near the center of the image. The patient's abdomen is visible, and the surgical instruments are clearly visible, indicating the ongoing medical procedure."}
{"question_id": 13, "question_text": "Describe the image concisely.", "text": "The image shows a close-up view of a person's open mouth, revealing the inside of their throat. The mouth is wide open, and the throat appears to be inflamed. The image is captured in a black and white color scheme, which adds a dramatic effect to the scene."}
{"question_id": 14, "question_text": "Describe the image concisely.", "text": "The image shows a close-up view of a person's stomach, specifically focusing on the lower part of the abdomen. The stomach appears to be inflamed, and there are several black dots visible on the surface. The image is captured in a dark room, possibly a medical setting."}
{"question_id": 15, "question_text": "Describe the image concisely.", "text": "The image displays a close-up view of a person's stomach, showing the inside of their abdomen. The stomach is filled with a yellow substance, possibly indicating an infection or other medical condition. The image is accompanied by a diagram, possibly a medical illustration, which provides context and information about the stomach and its contents."}
{"question_id": 16, "question_text": "Describe the image concisely.", "text": "The image displays a medical procedure being performed on a person's abdomen. A surgeon is using a laparoscope to examine the area, and a camera is attached to the laparoscope, allowing the surgeon to view the internal organs clearly. The surgeon is holding a tool, possibly a scalpel or a cautery, to perform the surgery."}
{"question_id": 17, "question_text": "Describe the image concisely.", "text": "The image displays a close-up view of a surgical procedure, likely an endoscopy, taking place in a human body. The focus is on a small, red, and white area within the body, possibly an infected area. The surgical tool is visible, and the image is captured in a time-lapse format, showing the progression of the procedure."}
{"question_id": 18, "question_text": "Describe the image concisely.", "text": "The image displays a close-up view of a person\\'s abdomen, likely a medical professional\\'s examination. The abdomen is filled with a yellow substance, possibly indicating an infection or inflammation. The area is also described as having a \"hole\" in it, which could be a sign of an issue or a part of the medical examination. The image is displayed on a computer screen, providing a detailed view of the abdomen and its contents."}
{"question_id": 19, "question_text": "Describe the image concisely.", "text": "The image displays a close-up view of a human throat, with a camera capturing the area. The throat appears to be infected, as there is a pink substance, possibly blood, covering the area. The camera is positioned to the left side of the throat, providing a clear view of the infection."}
{"question_id": 20, "question_text": "Describe the image concisely.", "text": "The image displays a close-up view of a person's mouth, with the camera positioned at the bottom of the frame. The mouth is open, revealing the inside of the oral cavity. The image is captured using a camera, possibly a smartphone, and the focus is on the mouth and its surroundings."}
{"question_id": 21, "question_text": "Describe the image concisely.", "text": "The image shows a close-up view of a person's stomach, with a blue light illuminating the area. The stomach is filled with blue liquid, and there is a small blue object inside the stomach. The scene appears to be a medical examination or procedure, possibly related to the digestive system."}
{"question_id": 22, "question_text": "Describe the image concisely.", "text": "The image displays a close-up view of a person's throat, showing a large, open wound or hole in the throat. The wound appears to be infected, and there is a visible pus-like substance within the hole. The throat is surrounded by a dark background, emphasizing the wound's presence."}
{"question_id": 23, "question_text": "Describe the image concisely.", "text": "The image displays a close-up view of a human body, focusing on a large, bright red organ. The organ appears to be an inflamed or infected part of the body, possibly a stomach or an intestine. The image is captured in a medical setting, possibly during an endoscopy, as it shows the organ through a camera lens."}
{"question_id": 24, "question_text": "Describe the image concisely.", "text": "The image shows a close-up view of a person's stomach, with a focus on a small, pink, possibly infected area. The stomach appears to be swollen, and the pink area is located near the center of the image. The image is displayed on a computer screen, providing a detailed view of the person's internal organs."}
{"question_id": 25, "question_text": "Describe the image concisely.", "text": "The image displays a close-up view of an inflamed and infected intestine, likely from a person with Crohn's disease. The intestine is filled with pus and has a dark red appearance. The image also shows a computer screen displaying the inflamed intestine, likely from a medical imaging or diagnosis."}
{"question_id": 26, "question_text": "Where is the polyp located in the image", "text": "The polyp is located in the lower part of the image, near the bottom of the screen."}
{"question_id": 27, "question_text": "Describe the image concisely.", "text": "The image displays a close-up view of a medical procedure, likely an endoscopy, taking place in a dark room. The scene features a microscope, which is capturing the details of the procedure. There are several people present in the room, possibly doctors and nurses, attending to the patient during the procedure."}
{"question_id": 28, "question_text": "Describe the image concisely.", "text": "The image displays a close-up view of a person's stomach, showing a large, open wound with a red substance inside. The wound appears to be infected, and the surrounding area is covered in blood. The image is captured using a microscope, providing a detailed view of the affected area."}
{"question_id": 29, "question_text": "Describe the image concisely.", "text": "The image displays a medical procedure being performed on a person's abdomen. A surgeon is using a camera to view the internal organs and perform the surgery. The surgeon is using a tool to remove a small piece of tissue from the abdomen. The image captures the surgical process, providing a clear view of the procedure."}
{"question_id": 30, "question_text": "Describe the image concisely.", "text": "The image displays a close-up view of a person's stomach, showing the inside of their abdomen. The stomach appears to be inflamed, and there is a visible hole in the center of the image. The image is captured on a computer screen, providing a detailed view of the affected area."}
{"question_id": 31, "question_text": "Describe the image concisely.", "text": "The image displays a close-up view of a person's stomach, showing a large, open, and dirty-looking wound. The wound appears to be infected, and it is surrounded by a yellowish substance. The area around the wound is covered in pus, which further emphasizes the infection. The image is captured in a medical setting, possibly during a surgical procedure."}
{"question_id": 32, "question_text": "Describe the image concisely.", "text": "The image displays a close-up view of a person's stomach area, likely a woman's, with a visible hole in the skin. The hole appears to be a surgical wound, and the surrounding area is red and inflamed. The image also shows a computer screen with a graphic of the stomach area, providing a visual representation of the affected area."}
{"question_id": 33, "question_text": "Describe the image concisely.", "text": "The image displays a close-up view of a human stomach, showing the inside of the abdominal cavity. The stomach appears to be inflamed, and there are numerous small black specks or dots visible throughout the area. The image is captured in black and white, emphasizing the details of the inflammation and the stomach's structure."}
{"question_id": 34, "question_text": "Describe the image concisely.", "text": "The image displays a computer screen with a close-up view of a person's stomach, showing a large, inflamed, and possibly infected area. The screen is filled with information about the patient's condition, including details about the inflammation and the presence of bacteria. The image is likely a medical image or a screen capture from a medical program."}
{"question_id": 35, "question_text": "Where is the polyp located in the image", "text": "The polyp is located in the stomach area, specifically in the lower part of the abdomen."}
{"question_id": 36, "question_text": "Describe the image concisely.", "text": "The image displays a medical screen showing a close-up of a person's abdomen. The screen is displaying a picture of the inside of the abdomen, which includes the intestines and other organs. The image is likely taken from a medical device, such as a colonoscope, which is used for examining the inside of the body."}
{"question_id": 37, "question_text": "Describe the image concisely.", "text": "The image displays a close-up view of a human stomach, likely during a medical procedure. The stomach is shown with a blue substance, possibly a contrasting dye, and a small object, possibly a camera, is visible within the stomach. The image is captured on a screen, providing a clear view of the internal organs and the ongoing procedure."}
{"question_id": 38, "question_text": "Describe the image concisely.", "text": "The image displays a close-up view of a person's abdominal area, focusing on the area around the stomach. The stomach appears to be swollen and has a dark, possibly infected, appearance. The image also shows a visible heart, which is located near the center of the image."}
{"question_id": 39, "question_text": "Describe the image concisely.", "text": "The image shows a close-up view of a person's stomach, with the camera focusing on the inside of the abdomen. The stomach is surrounded by a clear liquid, which appears to be a saline solution. The camera is positioned at a 45-degree angle, providing a detailed view of the internal organs."}
{"question_id": 40, "question_text": "Where is the polyp located in the image", "text": "The polyp is located in the lower part of the image, specifically in the lower abdomen area."}
{"question_id": 41, "question_text": "Where is the polyp located in the image", "text": "The polyp is located in the lower part of the image, specifically in the lower part of the stomach."}
{"question_id": 42, "question_text": "Describe the image concisely.", "text": "The image shows a close-up view of a person's throat, likely taken by a doctor. The throat is visible, along with a hole in the center, which is the entrance to the stomach. The area around the hole appears to be inflamed, possibly due to an infection or other medical condition. The image is captured in a black and white color scheme, emphasizing the details of the throat and the hole."}
{"question_id": 43, "question_text": "Where is the polyp located in the image", "text": "The polyp is located in the lower part of the image, specifically in the lower part of the stomach."}
{"question_id": 44, "question_text": "Where is the polyp located in the image", "text": "The polyp is located in the lower part of the stomach, near the rectum."}
{"question_id": 45, "question_text": "Describe the image concisely.", "text": "The image displays a close-up view of a human stomach, showing a large, dark mass in the center of the abdomen. The mass appears to be a cyst, surrounded by a network of blood vessels. The stomach is surrounded by a black background, emphasizing the cyst's prominence in the scene."}
{"question_id": 46, "question_text": "Where is the polyp located in the image", "text": "The polyp is located in the lower part of the image, specifically in the lower part of the stomach."}
{"question_id": 47, "question_text": "Describe the image concisely.", "text": "The image displays a close-up view of a person's throat, showing the inside of their mouth and the back of their tongue. The throat is surrounded by a bright light, which highlights the area and provides a clear view of the anatomy. The image also shows a small hole in the throat, possibly indicating an issue or a medical condition."}
{"question_id": 48, "question_text": "Where is the polyp located in the image", "text": "The polyp is located in the lower part of the image, in the middle of the open stomach."}
{"question_id": 49, "question_text": "Describe the image concisely.", "text": "The image displays a close-up view of a person's ear, specifically focusing on the inside of the ear canal. The ear is visible from the eardrum to the outer ear, providing a detailed look at the inner workings of the human ear."}
{"question_id": 50, "question_text": "WDescribe the image concisely.", "text": "The image displays a close-up view of a person's abdominal area, likely an ultrasound or a medical image. The area is filled with a lot of white spots, which could be a sign of inflammation or an infection. The image is displayed on a computer screen, providing a detailed view of the person's internal organs."}
{"question_id": 51, "question_text": "Where is the polyp located in the image", "text": "The polyp is located in the lower part of the image, which is the colon."}
{"question_id": 52, "question_text": "Where is the polyp located in the image", "text": "The polyp is located in the lower part of the image, on the lower part of the stomach."}
